{
  "Title": "The Knight's Journey to Ronnie",
  "Scenes": [
    {
      "SceneId": "S001",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero was once a loyal knight in the royal army, forged in the fires of war. When peace finally came to his land, the king's army was downsized and he was honorably dismissed. With no war to fight and no family to call his own, he found himself drifting through life, a soldier without a purpose. All he had known since boyhood was the discipline of the barracks and the brotherhood of battle. Now, in peacetime, he was just another unemployed swordsman scraping by.",
      "NextScene": "S002"
    },
    {
      "SceneId": "S002",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The sudden peace was kind to the kingdom but cruel to its warriors. The hero fell into poverty, surviving on odd jobs and the meager savings from his soldier's pay. He was not alone in this misfortune – many soldiers were poorly paid, and even knights often found themselves in penury once the wars ended. He wandered from village to village, sometimes taking work as a farmhand or a guard for merchant caravans, but the coins never lasted long. Every night he slept under the stars or in drafty stables, clad in a threadbare cloak. His stomach often rumbled with hunger, a stark contrast to the feasts that celebrated the war's end in the king's halls.",
      "NextScene": "S003"
    },
    {
      "SceneId": "S003",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Though only in his early thirties, he felt old and worn. Scars crisscrossed his arms and back, reminders of battles long past. He tried not to think of those days, but the memories came unbidden in the dark. He remembered muddy fields after battle, the ground... muddy, slippery with rain and blood, and comrades screaming as they fell. Being in a battle had been a brutal, terrifying experience where any notion of honor was overwhelmed by death and fear. Those nightmares visited him often. Sometimes he woke in a cold sweat, heart pounding as if he were back on the battlefield. Other times, he awoke to crushing loneliness – he had never known his parents or siblings, and the army had been his only family. Now that too was gone.",
      "NextScene": "S004"
    },
    {
      "SceneId": "S004",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "One autumn night, as he shivered through sleep beside the embers of a dying fire, the hero had a dream unlike any other. In this dream, he saw a land beyond distant mountains, a place of lush green hills and clear flowing rivers. In that land, there was no hunger, no suffering, and no sorrow – people smiled and there was laughter in the warm golden light. He saw children with full bellies, heard songs on the breeze, and felt peace wash over him. A name echoed in his mind like a heavenly bell: Ronnie. The vision was so vivid that when he awoke just before dawn, he could still smell the sweet air of that dream country and feel the hope it stirred in his chest.",
      "NextScene": "S005"
    },
    {
      "SceneId": "S005",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "That morning, the hero made a fateful decision. With nothing to lose and a newfound spark in his heart, he resolved to journey beyond the mountains in search of Ronnie, the land of plenty and peace from his dream. Perhaps it was a folly, a desperate fantasy of a starving man – but it was also the first time in years he had a goal to live for. He gathered what little he possessed: a dented sword he had kept from his army days, a small dagger, and a pouch with a few crumbs of bread and hard cheese. He had no map and only the vaguest idea that beyond the eastern mountains lay uncharted territories. Still, he set out at sunrise, walking stick in hand, the rising sun at his back and the towering silhouettes of mountains ahead. The journey of self-discovery had begun.",
      "NextScene": "S006"
    },
    {
      "SceneId": "S006",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Chapter 2: Hunger on the Road",
      "NextScene": "S007"
    },
    {
      "SceneId": "S007",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero’s journey led him eastward for many long days. At first, he passed through familiar villages where the sight of his old military cloak earned him a free bowl of soup or a night’s shelter from kindly peasants who remembered the war. But as he pressed farther from the heart of the kingdom, the settlements grew sparse and the nights lonelier. Gentle farmlands gave way to rocky fields and stretches of woodland. With each mile, the great mountains drew closer, their snow-capped peaks a solemn promise on the horizon.",
      "NextScene": "S008"
    },
    {
      "SceneId": "S008",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "By the second week, the hero’s boots were wearing thin and his provisions nearly gone. The little bag of bread and cheese had dwindled to almost nothing. He tightened his belt to stave off the hunger pangs. His cheeks grew hollow and his steps heavy. Still, he pushed on, driven each dawn by the memory of Ronnie’s lush valleys in his dream. At times he whispered to himself to keep away despair: “Just a little further. There must be something good beyond those peaks.”",
      "NextScene": "S009"
    },
    {
      "SceneId": "S009",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "One cold evening, under a dull gray sky, the hero stumbled upon a narrow dirt road winding through a sparsely wooded stretch. Dusk was falling. That was when he spotted a curled-up figure near the side of the path, beneath a leafless oak tree. As he drew closer, he saw it was an old man, gaunt and ragged. The man’s lips were cracked, his eyes sunken. He was alive but barely, each shallow breath a struggle. A small bundle lay beside him – perhaps all his worldly possessions, which amounted to almost nothing.",
      "NextScene": "S010"
    },
    {
      "SceneId": "S010",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero knelt and gently shook the starving stranger’s shoulder. The old man’s eyes fluttered open. In a weak voice he begged, “Food… please, anything…” The hero’s heart clenched at the sight. He too was starving; in his satchel he had only one hard piece of bread left – his last meal until he could find another village or hunt for game. The nearest village might still be days away, and he had seen little more than squirrels and roots in this barren stretch of land.",
      "NextScene": "S011"
    },
    {
      "SceneId": "S011",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Night was settling in, and the wind had a bitter bite. The hero knew that without food, the old man would not last until morning. But if the hero gave up what little food he had, he himself might collapse from hunger on the road ahead. His dream of Ronnie suddenly felt more distant and uncertain in the face of this very real dilemma in front of him. He remembered the countless hungry mouths he had seen after battles, refugees and orphans, and how often he had turned away then under orders or necessity. Now there were no orders – only his own conscience and the quiet trees as witnesses.",
      "NextScene": "S012"
    },
    {
      "SceneId": "S012",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He reached slowly into his satchel and wrapped his fingers around the last piece of bread. It was tough and small, but life for one more day. His stomach growled at the thought of parting with it. The old man before him was watching, eyes wide with desperation. The hero realized this choice would define more than just this moment – it could shape the kind of man he was becoming on this journey. Would he hold onto his bread and his life at all costs, or risk his own survival to show mercy?",
      "NextScene": "S013"
    },
    {
      "SceneId": "S013",
      "Type": "choice",
      "ShowInGame": true,
      "Text": "Decision – The Starving Stranger: The hero is starving and only has a single piece of bread left. He encounters a stranger dying of hunger on the roadside. What should he do?",
      "NextScene": null,
      "LeftChoiceText": "Option 1: Share his last bread with the starving stranger, even if it means he might go hungry.",
      "RightChoiceText": "Option 2: Keep his food for himself and move on, leaving the stranger to fate.",
      "LeftChoice": "S019",
      "RightChoice": "S034"
    },
    {
      "SceneId": "S014",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 1: Share his last bread with the starving stranger, even if it means he might go hungry.",
      "NextScene": "S015"
    },
    {
      "SceneId": "S015",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 2: Keep his food for himself and move on, leaving the stranger to fate.",
      "NextScene": "S016"
    },
    {
      "SceneId": "S016",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Shares His Food",
      "NextScene": "S017"
    },
    {
      "SceneId": "S017",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Defends the Village",
      "NextScene": "S018"
    },
    {
      "SceneId": "S018",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Shares His Food",
      "NextScene": "S019"
    },
    {
      "SceneId": "S019",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero cannot ignore the plea before him. With a resolve born of compassion, he breaks his last hard bread in half and gently lifts the old man’s head. He coaxes the stranger to chew the dry crust. The old man eats greedily, using what little saliva he has to soften the bread, and tears of gratitude well up in his eyes. “Thank you, kind sir,” he whispers hoarsely. The hero hushes him and offers the rest of the bread, along with a few sips from his water skin. Though his own stomach cries out in protest, the hero manages a reassuring smile. That night, he stays by the stranger’s side, keeping a small fire going for warmth. They huddle close under the hero’s thin blanket, two destitute souls sharing a moment of human kindness in the wilderness.",
      "NextScene": "S020"
    },
    {
      "SceneId": "S020",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "As the firelight dances on their faces, the old man finds his voice and tells his tale. His name is Gerald, a farmer from a village called Oakcrest a few days’ walk ahead. Oakcrest, he says, was attacked by a band of marauders – former soldiers turned brigands who prey on defenseless hamlets. With trembling words, Gerald describes how the bandits stormed in at dawn, looting and burning with merciless glee. He lost his family in the chaos and fled into the woods with nothing but the clothes on his back. “They burned everything,” he murmurs, staring into the flames. The hero’s heart weighs heavy hearing this. He recalls sights from his own wartime past – villages sacked and innocents caught in the crossfire – and he clenches his jaw. Gerald goes on to say some folk speak of safer lands beyond the mountains, though he knows little more. The hero gently shares his dream of Ronnie, the land of plenty with no sorrow. The old man’s eyes light up for a moment. “If you find this Ronnie,” Gerald says, voice cracking, “remember us... remember those who couldn’t escape the sorrow.” The hero nods solemnly. He tends Gerald through the cold night, doing what he can for the feverish, exhausted man.",
      "NextScene": "S021"
    },
    {
      "SceneId": "S021",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "By dawn, Gerald is breathing easier, though he remains too frail to travel. The hero helps the old farmer onto a softer bed of moss and leaves him the empty water skin – a silent promise to return or send help if Ronnie truly lies ahead. Gerald presses a shaking hand over the hero’s. “You gave me hope when I had none,” he says weakly. “May your kindness return to you on your road.” With that blessing in his ears, the hero departs, hunger gnawing at his belly but determination burning bright. He has nothing left to eat, but he cannot turn back now.",
      "NextScene": "S022"
    },
    {
      "SceneId": "S022",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The day’s march is arduous. With each step, the hero grows more lightheaded. He scavenges what he can – a handful of bitter berries here, a few edible roots there – but it’s not enough to silence his hunger. Around midday, rain begins to drizzle from a slate-colored sky. The hero pulls up his hood and trudges onward along the dirt road, now turning muddy underfoot. When the rain passes, he notices a smudge of dark smoke on the horizon, beyond the next ridge. Hope sparks within him: smoke could mean chimneys – a village where he might find food and shelter.",
      "NextScene": "S023"
    },
    {
      "SceneId": "S023",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Summoning his last reserves of strength, the hero quickens his pace. As he nears the source of the smoke, an acrid scent hits his nostrils – not the welcoming smell of hearth fires, but the stench of charred wood and something fouler. He crests the ridge and looks down into a small valley. There lies a settlement – likely Oakcrest, just as Gerald described – but devastation has befallen it. Several cottages are ablaze, thick black smoke curling into the afternoon sky. Figures dart between the buildings. The hero squints: armed men are in the village, shouting orders and laughing harshly. He realizes with a surge of anger that bandits are in the midst of raiding Oakcrest even now.",
      "NextScene": "S024"
    },
    {
      "SceneId": "S024",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "From his vantage point behind some bushes on the hillside, the hero surveys the scene. Villagers run screaming; he sees a woman carrying a child try to flee, only to be yanked back by a burly raider. The bandit knocks her to the ground. Nearby, an elderly man lies motionless beside the well, blood staining the stones. A knot of three bandits are gathering sacks of grain and whatever valuables they can find, while another group corrals terrified villagers into the dirt square at the center of Oakcrest. It’s a scene of horror, one that makes the hero’s blood boil. These could be the very men who destroyed Gerald’s home and killed innocents.",
      "NextScene": "S025"
    },
    {
      "SceneId": "S025",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero’s hand falls to the hilt of his old sword. His muscles tense with righteous anger. Despite his weakness and the odds, every instinct in him screams to intervene, to at least save whomever he can from these marauders. But as he observes, he counts at least six bandits, all seemingly well-fed and armed with swords and axes. They are rough men, clad in bits of mismatched armor, likely stolen off fallen soldiers. The hero knows he is in no shape for a prolonged fight – hunger and exhaustion have made his limbs heavy. One man against six is nearly a death sentence, even for a trained fighter like him, especially on an empty stomach.",
      "NextScene": "S026"
    },
    {
      "SceneId": "S026",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "A scream from the village below tears at his heart. He watches a bandit strike down a kneeling villager, and the sight ignites a flame of rage inside him. He remembers the promise he made to Gerald to remember those who couldn’t escape. Here are people who still might be saved if someone had the courage to stand up for them. Perhaps his act of mercy earlier was a step toward becoming the kind of man who would risk himself for others.",
      "NextScene": "S027"
    },
    {
      "SceneId": "S027",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Yet a cold whisper of fear nips at him as well. What good will it do anyone if he dies here in a futile attempt? If he falls, who will journey on to find Ronnie and perhaps bring help or hope to others? Hidden in the underbrush, the hero closes his eyes for a moment. He must decide quickly – the bandits show no signs of mercy or slowing their rampage.",
      "NextScene": "S028"
    },
    {
      "SceneId": "S028",
      "Type": "choice",
      "ShowInGame": true,
      "Text": "Decision – The Burning Village: The hero comes upon Oakcrest village under attack by brutal bandits. He is weak and outnumbered, but his conscience urges him to act.",
      "NextScene": null,
      "LeftChoiceText": "Option 1: Summon his courage and intervene, charging into the village to fight the bandits and defend the villagers.",
      "RightChoiceText": "Option 2: Stay hidden and do not intervene, avoiding conflict to save himself, and wait for the bandits to leave.",
      "LeftChoice": "S034",
      "RightChoice": "S054"
    },
    {
      "SceneId": "S029",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 1: Summon his courage and intervene, charging into the village to fight the bandits and defend the villagers.",
      "NextScene": "S030"
    },
    {
      "SceneId": "S030",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 2: Stay hidden and do not intervene, avoiding conflict to save himself, and wait for the bandits to leave.",
      "NextScene": "S031"
    },
    {
      "SceneId": "S031",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Defends the Village",
      "NextScene": "S032"
    },
    {
      "SceneId": "S032",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Continues to Ronnie",
      "NextScene": "S033"
    },
    {
      "SceneId": "S033",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Defends the Village",
      "NextScene": "S034"
    },
    {
      "SceneId": "S034",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Steeling himself, the hero decides he cannot stand by. With a hoarse cry to rally his spirit, he breaks cover and charges down the slope toward the burning village. The first bandit never sees death coming – the hero drives his sword between the thug’s ribs from behind as the man is about to strike another villager. The bandit drops with a grunt. For an instant, the other raiders stare in surprise at the wild-eyed knight who has appeared out of nowhere. The hero uses that moment to position himself between the villagers and their attackers. “Run to the woods!” he shouts to the villagers, hoping some can escape. A burly bandit with a notch-bladed axe recovers from shock and rushes at the hero. Their weapons meet with a ringing clash of steel.",
      "NextScene": "S035"
    },
    {
      "SceneId": "S035",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "What follows is a desperate battle for life. The hero ducks a wild swing of the axe and counters with a slash across the bandit’s arm. Another assailant lunges with a spear; the hero pivots, narrowly avoiding the thrust, and slashes the spear’s shaft in two. Villagers scream and scatter for cover as the melee spreads across the village square. The hero’s sword cuts a furious arc through the sooty air, keeping the bandits at bay despite their numbers. His mind flashes to his old battles – the chaos, the adrenaline. The smell of blood, sweat, and death is overpowering as he strikes down a second foe. A third bandit charges him with a roar; they lock blades, face to face. The outlaw’s teeth are bared in a snarl, and the hero can feel the man’s hot breath. Summoning a last burst of strength, the hero shoves him back and delivers a fatal blow.",
      "NextScene": "S036"
    },
    {
      "SceneId": "S036",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "A searing pain suddenly bites across the hero’s left side – another bandit’s sword has found flesh. He stumbles, blood soaking his torn tunic. The wound is bad, but not immediately mortal. Gritting his teeth against the agony, the hero refuses to fall. He parries the next attack clumsily; his arms grow heavier by the second. Just when it seems a flanking bandit might finish him, a stone whizzes through the air and strikes that bandit’s head. One of the villagers has joined the fray, hurling rocks from a rooftop at the attackers. Emboldened, another villager, a young blacksmith, rushes out with a crude hammer and clubs one of the distracted raiders in the back. The odds begin to tip.",
      "NextScene": "S037"
    },
    {
      "SceneId": "S037",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The remaining bandits, dismayed that their easy pillage has turned into a pitched fight, falter when their leader falls to the hero’s blade. At last, with a furious shout, the final two turn and flee, disappearing into the trees with their lives. The village of Oakcrest has been saved, though at a painful cost. As the adrenaline that sustained him ebbs, the hero collapses to one knee. Around him lie the bodies of bandits and a few villagers who were lost in the fighting. The ground is muddy and slippery with blood, and the air is thick with smoke and the coppery scent of spilled life. The hero’s vision swims, but he can still see villagers emerging cautiously from hiding. The nightmare is over, for now.",
      "NextScene": "S038"
    },
    {
      "SceneId": "S038",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Strong arms gently lift the hero and carry him into the nearest intact cottage. A gray-haired woman who had been hiding there tears strips from a clean linen sheet to bind the bleeding gash in his side. The surviving villagers gather round their wounded savior with murmurs of gratitude and awe. They call him a hero – their champion who appeared when all seemed lost. Over the next hours, they tend to him and to their own wounded. Though wracked with pain and feverish from his injury, the hero helps as he can, directing them to check on the injured and comfort the frightened. The people of Oakcrest work through the night to douse the remaining fires and bury the dead, both neighbors and the bandits who fell.",
      "NextScene": "S039"
    },
    {
      "SceneId": "S039",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "For two days, the hero remains in Oakcrest to recover. He drifts in and out of consciousness on a straw pallet in the village elder’s cottage. Each time he wakes, he finds someone has set broth or bread by his bedside. Despite their own losses, the villagers ensure the man who saved them does not want for food or care. A youth keeps his water skin filled, and an old herb-woman applies poultices to his wound. The hero’s strength slowly returns. His hunger is not only sated but met with warm goat’s milk and vegetable stew – simple fare that tastes like a king’s feast after his many hungry days. True to Gerald’s blessing, the hero’s earlier kindness comes full circle: because he fed a starving stranger, now he himself is fed and healed by strangers’ gratitude.",
      "NextScene": "S040"
    },
    {
      "SceneId": "S040",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "By the third morning, the hero is able to walk steadily again, and his wound, though sore, is bound tight and clean. The carnage of the raid has been cleared; Oakcrest is battered but alive. As he prepares to depart, the villagers gather to see him off. They provide him with what provisions they can spare for his journey: a loaf of coarse bread, a wheel of dried cheese, a pouch of smoked meat, and a flask of fresh water. One man offers his sturdy walking stick to replace the hero’s own, which was lost in the fray. They also gift him a thick woolen cloak retrieved from the ruins – it once belonged to the elder’s late son, and now the hero will carry it forward.",
      "NextScene": "S041"
    },
    {
      "SceneId": "S041",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "“You saved us at your own great peril,” the village elder says, a weathered hand on the hero’s shoulder. “We cannot repay you fully, but know that you will always have a home here if you should return.” The hero thanks them humbly, feeling a swell of emotion. In such a short time, these people have come to care for him more than his own country ever seemed to after the war. He realizes that by helping them, he has found a piece of the fellowship he lost when the army disbanded.",
      "NextScene": "S042"
    },
    {
      "SceneId": "S042",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Before he leaves, the hero quietly visits the edge of the village where small cairns mark freshly dug graves. He pays respects to those who died, promising silently that their bravery and suffering will not be forgotten. Among the graves, he finds one marked with a hastily carved plank: Gerald. The old farmer must have succumbed to his hardships after the hero left him. The hero bows his head, grief and determination mixing in his heart. “I will remember,” he whispers, recalling how Gerald asked him to remember those who suffered.",
      "NextScene": "S043"
    },
    {
      "SceneId": "S043",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "With the villagers’ hopes and gratitude urging him onward, the hero resumes his journey east. The great mountains loom nearer now, close enough that he can make out dark pine forests blanketing their lower slopes and pale caps of snow above. The air grows cooler and thinner as he follows a winding path out of Oakcrest. He feels stronger than he has in weeks, buoyed by both nourishment and a renewed sense of purpose. No longer is he traveling merely for himself; in his mind, he carries the wishes of the people he has helped. If Ronnie – the land of no sorrow – truly exists, perhaps he can reach it and bring back aid or at least the promise of a new home for those like the Oakcrest survivors.",
      "NextScene": "S044"
    },
    {
      "SceneId": "S044",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Several more days pass as the hero treks into the foothills. The terrain becomes rugged. He crosses rushing streams of clear icy water and navigates around steep, rocky outcrops. The new cloak keeps him warm when chill mountain winds blow down at dusk. Occasionally, he spots distant pillars of smoke or hears faint sounds echoing in the valleys – signs that conflict still troubles the world behind him. He presses on, trying not to dwell on the violence he has seen, focusing instead on the vision of Ronnie’s peace.",
      "NextScene": "S045"
    },
    {
      "SceneId": "S045",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "At last, the hero arrives at the foot of the final climb – a narrow, ancient mountain pass that winds upward between two jagged peaks. The path is little more than a goat trail in places, with loose stones and sheer drops into misty gorges below. Local lore (from a hunter in Oakcrest) warned him that few travelers dare this route except in high summer, and now autumn is waning. Clouds gather around the snow-laden peaks, threatening bad weather. Beyond this pass lies the unknown. It could lead to the verdant lands of his dream... or to nothing at all.",
      "NextScene": "S046"
    },
    {
      "SceneId": "S046",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Standing at the threshold of the high pass, the hero feels a tremor of both excitement and fear. The sky ahead is iron-gray, and a cold drizzle begins to fall. The rocks will be slick. One misstep on the cliffs could mean death on the jagged rocks below. He tightens the straps of his pack and pulls his cloak close. This is the final test of his resolve. Ronnie might be days or weeks beyond these mountains – or it might not exist at all. If he perishes on the slopes, all his journey and the hopes he carries would be for naught. He glances back down the trail behind him, which winds back toward Oakcrest and the lands he knows. He could return to Oakcrest, where people would welcome him, or journey back to the kingdom with the wisdom he has gained. He could choose to live, even if it means never knowing for sure whether Ronnie was real.",
      "NextScene": "S047"
    },
    {
      "SceneId": "S047",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero closes his eyes and breathes in the thin, cold air. In his mind, he sees two paths: one continues upward into the high, unforgiving mountains in pursuit of a dream; the other turns back to the world he came from, carrying the hard-earned lessons and perhaps offering his strength to those in need at home. Both paths call to different parts of him – the dreamer and the realist, the adventurous soul and the weary warrior.",
      "NextScene": "S048"
    },
    {
      "SceneId": "S048",
      "Type": "choice",
      "ShowInGame": true,
      "Text": "Decision – The Last Leg: The hero stands before the treacherous mountain pass that leads beyond the known world. He must choose his final path.",
      "NextScene": null,
      "LeftChoiceText": "Option 1: Brave the dangerous pass and continue onward, determined to find the truth of Ronnie beyond the mountains.",
      "RightChoiceText": "Option 2: Turn back from the pass, deciding that his journey ends here, and return to make use of what he’s learned on more familiar soil.",
      "LeftChoice": "S054",
      "RightChoice": "S063"
    },
    {
      "SceneId": "S049",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 1: Brave the dangerous pass and continue onward, determined to find the truth of Ronnie beyond the mountains.",
      "NextScene": "S050"
    },
    {
      "SceneId": "S050",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 2: Turn back from the pass, deciding that his journey ends here, and return to make use of what he’s learned on more familiar soil.",
      "NextScene": "S051"
    },
    {
      "SceneId": "S051",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Continues to Ronnie",
      "NextScene": "S052"
    },
    {
      "SceneId": "S052",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S053"
    },
    {
      "SceneId": "S053",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Continues to Ronnie",
      "NextScene": "S054"
    },
    {
      "SceneId": "S054",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero steels himself and steps onto the perilous pass, determined to see his dream through. The climb is punishing. Thin air burns in his lungs, and jagged rocks cut his hands and knees as he scrambles upward. Several times, he nearly loses his footing on an icy patch or loose gravel, but each time he steadies himself, recalling the faces of those who believed in him. He climbs for hours, as daylight fades into a gentle golden hue behind the peaks. Just when he fears the darkness will force him to stop on some exposed ledge, he finds himself at the crest of the pass.",
      "NextScene": "S055"
    },
    {
      "SceneId": "S055",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Before him stretches a landscape bathed in the last light of the setting sun. The storm clouds part as if by a miracle’s timing, revealing a broad valley beyond the mountains. The hero gasps. Down below lies a tapestry of green and gold – lush meadows dotted with wildflowers, groves of fruit-laden trees, and a winding river glinting like a ribbon of silver. It is exactly as he dreamed on that fateful night: a land untouched by war, cradled safely between towering peaks. Though weary and battered, the hero laughs out loud, a joyous, incredulous sound that echoes off the rocks. Ronnie exists. It was not just a hopeful illusion but a real place, hidden all this time beyond sorrow and strife.",
      "NextScene": "S056"
    },
    {
      "SceneId": "S056",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "With renewed vigor, he descends into the valley. Along the riverbank, he spots simple cottages with thatched roofs and fields where crops sway gently in the evening breeze. People are there too – he sees a few figures walking along a dirt path, children chasing each other with carefree laughter, a farmer guiding an ox-drawn cart. These villagers notice the stranger emerging from the mountain trail with wary curiosity at first. A small group approaches him as he reaches the valley floor, their postures cautious but not hostile. They appear healthy, their faces browned by the sun and free of worry lines. One man, tall and broad-shouldered, raises a hand in greeting. “Welcome, traveler,” he calls, his voice carrying warmth. “You’ve come a long way. This is Ronnie – you must be seeking refuge.”",
      "NextScene": "S057"
    },
    {
      "SceneId": "S057",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Overcome with emotion, the hero nods, barely finding words. A young woman offers him a drink from a clay cup – cool, sweet water that tastes of hope itself. As he drinks, tears mix with the grime on his cheeks. He thinks of all the pain and choices that led him here. Every hardship, every act of bravery and compassion, even every mistake, now feels worth it. In this valley, it is said, there is no sorrow – and for the first time in his life, the hero truly understands what it means to have a burden lifted from his heart.",
      "NextScene": "S058"
    },
    {
      "SceneId": "S058",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In the days and weeks that follow, the hero becomes part of Ronnie’s community. The people welcome him without judgment, simply grateful for another pair of helping hands and another soul seeking peace. He tells them some of his journey – of war and famine, of villages like Oakcrest that suffered beyond the mountains. The folk of Ronnie listen with saddened eyes, for many of them also fled from sorrowful lands long ago. They place reassuring hands on his shoulders and invite him to stay as long as he wishes.",
      "NextScene": "S059"
    },
    {
      "SceneId": "S059",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero finds new purpose here. In the mornings, he works alongside farmers to till the rich soil or helps shepherds tend to flocks grazing on the hillsides. In the evenings, he sits by the hearth fire in the communal hall, sharing simple meals and gentle stories. Every night he sleeps with a roof over his head and a full stomach, often with the distant sound of lullabies or kindly laughter lulling him into a deep, dreamless rest. His scars – both visible and unseen – begin to heal under the balm of Ronnie’s way of life.",
      "NextScene": "S060"
    },
    {
      "SceneId": "S060",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Yet he never forgets the journey that brought him. True to his promise, he remembers those left behind. One bright spring morning, the hero climbs a hill at the edge of the valley where wildflowers bloom. He gazes toward the western mountains he crossed. Though he cannot see the lands beyond from here, he knows they are there – and that they still ache with sorrow and strife. In his hand he holds a small wooden carving of a smiling sun. He picked it up amid Oakcrest’s charred remains, a token of all the suffering he witnessed. With renewed determination, he decides that one day soon, he will guide others to Ronnie, just as he found his way. The path is dangerous, but he now carries hope like a torch to light it.",
      "NextScene": "S061"
    },
    {
      "SceneId": "S061",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "For now, though, he breathes in the sweet valley air and lets the sun warm his face. He has arrived. In Ronnie, the hero finally discovers what he was truly seeking all along – a place to belong, a life where he can be at peace with himself and do good without a sword in hand. The lush hills whisper in the breeze, as if welcoming him home. In this ending, our hero attains his dream: the journey’s trials lead him to Ronnie, the land without sorrow, where a once-lost knight can at last find rest and purpose.",
      "NextScene": "S062"
    },
    {
      "SceneId": "S062",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S063"
    },
    {
      "SceneId": "S063",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero stands at the threshold of the mountain pass for a long time, snowflakes gathering in his hair and on his shoulders. In the end, he lets out a slow breath and steps back from the ridge. He turns away from the unknown land beyond the peaks. Ronnie – whether real or imagined – will remain a dream. His path now leads downward, back to the world of his birth, the world of war and hardship that forged him.",
      "NextScene": "S064"
    },
    {
      "SceneId": "S064",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Climbing down is in some ways more difficult than climbing up. Each step back toward the foothills is heavy with a sense of loss. The hero’s dream urges him to reconsider with every glance over his shoulder at the towering pass, but he steels himself. He recalls the people he met along his journey – the villagers of Oakcrest rebuilding their lives, the hungry and the lost. They belong to the real world, a world that still needs folks who are willing to care and fight for others. Turning back from Ronnie is not failure, he tells himself, but a choice to face reality on its own terms.",
      "NextScene": "S065"
    },
    {
      "SceneId": "S065",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "When the hero returns to Oakcrest, the villagers are astonished and overjoyed. They had feared him dead in the mountains. Though they offered him a chance to find paradise, he has come back to their humble, scarred village. “Did you find what you were looking for?” a child asks him. The hero smiles gently and pats the boy’s head. “Not in the way I expected,” he replies, looking around at their faces – alive, determined, familiar. In their eyes, he sees gratitude and relief that he has returned. In that moment, he realizes that for him, Ronnie was less a place than an ideal – one he can work to build here, in the soil beneath his feet.",
      "NextScene": "S066"
    },
    {
      "SceneId": "S066",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "From that day on, the hero settles in Oakcrest and becomes an integral part of its renewal. With his soldier’s discipline and newfound compassion, he helps organize defenses so that the village will never again be caught off guard by bandits. He trains the willing – men and women alike – in basic spear and bow, turning frightened survivors into a capable community militia. Under his guidance, they fortify the perimeter with sharpened stakes and dig a ditch to serve as a palisade foundation. The next time trouble comes to Oakcrest, the village will be ready.",
      "NextScene": "S067"
    },
    {
      "SceneId": "S067",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "But it’s not only as a warrior that he contributes. The hero spends his mornings repairing roofs and helping farmers replant fields scorched in the raid. He uses knowledge gained from his travels to dig a new well closer to the village center, ensuring clean water. At night, by the common fire, he shares gentle tales of hope – stories of how he once dreamed of a land of no sorrow, and how perhaps they all can create a piece of that dream here. The villagers listen, hearts warmed by his conviction. In their battered home, they begin to smile again, to sing again, inspired by the man who returned to help them rather than chasing dreamland for himself.",
      "NextScene": "S068"
    },
    {
      "SceneId": "S068",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Months later, a traveler passing through Oakcrest might hardly recognize it as the same place that was nearly destroyed. New cottages stand where ashes were, and fields of wheat wave golden on the outskirts. Children play in the sunlight, watched over by neighbors who have learned the value of standing together. And at the forefront is our hero – not as a lord or ruler, but as a beloved friend and protector. He refuses any grand titles; when someone calls him “Sir Knight,” he chuckles and insists they just call him a neighbor.",
      "NextScene": "S069"
    },
    {
      "SceneId": "S069",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In quiet moments, the hero sometimes gazes toward the distant outline of the mountains. A hint of wistfulness crosses his eyes. He will always remember Ronnie, the bright vision that once guided him. Perhaps it truly exists somewhere beyond those peaks, or perhaps it was only ever an urging in his heart to become a better man. Either way, he has found his purpose. Here, in the realm of imperfect reality, he is making a difference – carving out, with each kind act and each brave deed, a small corner of the world where sorrow is lessened.",
      "NextScene": "S070"
    },
    {
      "SceneId": "S070",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Surrounded by friends and the humble fruits of their shared labor, the hero realizes that in turning back, he didn’t abandon his dream after all; he transformed it. Ronnie is wherever people strive to live without cruelty, where they support each other through hardships. In Oakcrest, he has helped build such a place. The journey gave him wisdom, and he puts it to use not in a far-off paradise, but right where he stands.",
      "NextScene": "S071"
    },
    {
      "SceneId": "S071",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Years later, travelers through the region speak of a resilient village led by a former knight with no name, a man who faced despair and chose to light a candle rather than curse the darkness. Under his care, Oakcrest and nearby hamlets flourish in peace. In this ending, our hero forsakes the elusive dream of Ronnie to turn back and aid those in need, finding not the paradise he imagined, but a sense of meaning and community more real and rewarding than any fantasy.",
      "NextScene": "S072"
    },
    {
      "SceneId": "S072",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Stays Hidden",
      "NextScene": "S073"
    },
    {
      "SceneId": "S073",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Heart pounding, the hero remains crouched in the thicket, paralyzed by the grim calculus of survival. He tells himself that charging in would only get him killed for nothing – in his weakened state, what chance does he have? So he watches, helpless and trembling, as the bandits carry out their heinous work. His fingers grip the hilt of his sword so tightly that his knuckles turn white, yet he cannot will his legs to move toward the fight.",
      "NextScene": "S074"
    },
    {
      "SceneId": "S074",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "From his hiding place, he witnesses horrors that will haunt him forever. The bandits show no mercy. He sees the burly axeman hack down an unarmed villager who tried to flee. A young girl’s wails cut through the crackle of flames as she is dragged by her hair before falling silent. Each scene etches itself into the hero’s memory, a permanent ledger of his guilt. He wants to scream, to charge out with his sword swinging – but each time he tenses to move, fear and weakness hold him back. He can do nothing but watch with tears of frustration in his eyes.",
      "NextScene": "S075"
    },
    {
      "SceneId": "S075",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "At last, with their sacks full of plunder and their bloodlust sated, the bandit gang rounds up a few surviving villagers (mostly young women and teenagers) and drives them off like livestock into the forest. The rest of Oakcrest lies silent save for the crackle of dying fires. The hero waits, stomach churning, until even the bandits’ laughter fades into the distance. Twilight falls. Only then does he creep down into the shattered village, heart heavy as a stone.",
      "NextScene": "S076"
    },
    {
      "SceneId": "S076",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The scene below is even worse up close. The modest cottages of Oakcrest have been reduced to smoldering skeletons of wood. Charred thatch hangs from blackened timbers. Bodies of the dead litter the ground where they fell – an old man clutching a rake, two little boys huddled together under a wagon, a mother still shielding her slain son with her own body. The hero’s breath shudders at the sheer devastation. He steps through the carnage like a ghost, his boot splashing in a puddle of blood-tinged water by the well. In the gathering dark, the burned village feels like the grave of all hope.",
      "NextScene": "S077"
    },
    {
      "SceneId": "S077",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Overwhelmed by remorse, the hero sinks to his knees beside the body of a middle-aged man who had fallen with a sword in hand. Perhaps this man tried to defend his home as the hero could not. “I’m sorry,” the hero whispers, voice cracking. He does not know if he is apologizing to the dead or praying for forgiveness from any listening gods. There is no reply – only the soft hiss of rain beginning to fall on the embers.",
      "NextScene": "S078"
    },
    {
      "SceneId": "S078",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero forces himself to search the ruins for any signs of life. He finds none. Every soul who did not flee has been killed or taken. In one half-collapsed hut, however, he does find a whimpering dog hiding under a broken table. The scrawny hound bristles at first, then crawls out, sniffing at the hero’s outstretched hand. The hero shares a moment of silent sorrow with the animal as it nudges its dead master’s boot and lets out a pitiful whine. He cannot save the villagers, but he coaxes the dog to follow him with soft clicks of his tongue.",
      "NextScene": "S079"
    },
    {
      "SceneId": "S079",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Desperate for some shred of redemption, the hero gathers the bodies of a few of the fallen and covers them with what blankets or sheets he can salvage from the wreckage. The soil is too hard and he is too weak to bury them properly, but he cannot simply leave them exposed to the elements and scavengers. Rain mingles with the soot and blood, washing streaks of red mud through the ruined village lanes. He works until he nearly collapses, dragging corpses under shelter or covering faces. Each act feels like a feeble penance.",
      "NextScene": "S080"
    },
    {
      "SceneId": "S080",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "By the time he finishes, full night has fallen. The hero realizes he is swaying on his feet from hunger and exhaustion. In the wreckage of what was Oakcrest’s small tavern, he finds a miracle of survival: a smoked ham, slightly singed but intact, that the bandits overlooked in their haste. The hero hesitates, the weight of guilt almost making him refuse this grim bounty. In the end, survival instinct wins – he is starving, and if he dies here too, there will be no one even to remember this tragedy. He takes the ham and a mostly-intact loaf of bread from the tavern’s pantry and eats in the company of the dead, each bite filling his belly but tasting of ash and shame.",
      "NextScene": "S081"
    },
    {
      "SceneId": "S081",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "That night, the hero cannot bear to sleep in any of the burnt homes. Instead, he retreats to the edge of the woods with the stray dog curled at his feet for warmth. Though physically safer, his mind offers no peace. Each time he closes his eyes, he sees the horrors replay – the girl’s scream, the mother’s lifeless arms around her child. In his fitful dreams, flames consume a beautiful green land and a voice in his head asks over and over: “Why didn’t you help us?” He wakes up multiple times with tears on his cheeks. The dream of Ronnie feels distant now, overshadowed by the nightmare he allowed to happen.",
      "NextScene": "S082"
    },
    {
      "SceneId": "S082",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "At dawn, the hero forces himself onward. There is nothing left in Oakcrest but ghosts and ashes. He whispers a farewell, unsure if it’s to Gerald’s memory or to the villagers whose names he will never know, then turns his back on the burnt remains. With the loyal dog trailing behind, he heads toward the mountains once more. The animal’s presence is a small comfort – a last living piece of Oakcrest that survived. He shares bits of the ham with the hound as they walk. In his pocket, he carries a scorched trinket he found amid the rubble: a tiny wooden carving of a smiling sun. Perhaps it was once a child’s toy or a household charm for good fortune. The hero keeps it clenched in his fist as he travels, a painful reminder of the lives lost and a token of responsibility he can never forget.",
      "NextScene": "S083"
    },
    {
      "SceneId": "S083",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "As the days pass and he ascends into the foothills, the physical world grows more challenging even as his provisions dwindle again. The bandits stripped the land bare; he finds few travelers on the road and no friendly villages to offer help. The mountains rise up ahead, magnificent but forbidding. Pine forests line their base, and beyond, rocky slopes reach toward the heavens. The hero trudges on, gaunt and grim. He speaks little, even to the dog, but in his silence his thoughts churn. He questions himself endlessly: was it cowardice or pragmatism that stayed his hand? If he finds Ronnie, does he even deserve its refuge after failing so many? Or is it all just a cruel fantasy he clings to in order to cope with his guilt?",
      "NextScene": "S084"
    },
    {
      "SceneId": "S084",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The air cools and thins as he climbs higher terrain. Autumn’s colors here are muted under frequent clouds. Occasionally, he spots distant plumes of smoke that make his heart skip – he prays they are just cooking fires of peaceful homesteads, not more villages aflame. He avoids these areas, skirting what might be settlements or camps, not trusting himself to confront any more evils. Instead, he keeps his eyes fixed forward.",
      "NextScene": "S085"
    },
    {
      "SceneId": "S085",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "After about a week since Oakcrest, the hero and the dog arrive at the foot of the main mountain pass that leads beyond the kingdom’s frontier. The animal whines and refuses to go further up the steep, craggy path; perhaps it senses the coming cold or has a homing instinct pulling it elsewhere. With a heavy heart, the hero kneels and pats the dog’s head one last time, grateful for the small companionship it provided. “Go on,” he urges softly, and the dog lopes back down the trail, soon disappearing among the trees. Now truly alone, the hero faces the towering ascent ahead.",
      "NextScene": "S086"
    },
    {
      "SceneId": "S086",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The mountain pass before him is a jagged scar slanting up through walls of granite. It’s known in half-whispered tales as Blackwind Pass, a route that few take willingly. The trail is narrow and strewn with loose rocks. Far above, he can see where early snow clings to the cliffs, promising perilous icy patches. A frigid wind howls down from the heights, as if warning him to turn back. The hero pulls his scavenged cloak tighter. His wound from the battle – or rather, from the non-battle he fled – has healed superficially, but an ache remains, whether from the injury or the guilt lodged in his soul.",
      "NextScene": "S087"
    },
    {
      "SceneId": "S087",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He stands at the threshold of the ascent and hesitates. This is likely his last chance to reconsider everything. Beyond these mountains might lie Ronnie, the dreamland that once filled him with hope. But after what transpired, he is filled with doubt. What if Ronnie is not there? Or what if it is there, but someone like him, stained with cowardice, cannot find solace in it? He also knows the journey through the pass could easily claim his life – a misstep on a cliff, a sudden rockslide, a blizzard high above.",
      "NextScene": "S088"
    },
    {
      "SceneId": "S088",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He swallows hard and looks back over his shoulder. In the distance, through breaks in the trees, he can just make out a hint of the lands he’s leaving: rolling foothills now shrouded in morning mist, and the faint column of smoke from Oakcrest’s still-smoldering ruins far behind. The guilt and sorrow of that place weigh on him like an anchor. Part of him thinks he should go back – perhaps to find any survivors or to somehow atone by warning others of the bandit dangers. Or even to return to the capital and report what happened here, trying to get justice. Turning back would mean living with his failure, but perhaps also doing something concrete with the life he still has.",
      "NextScene": "S089"
    },
    {
      "SceneId": "S089",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Another part of him argues that going forward is the only way to make any of this meaningful. If he can reach Ronnie, if it truly exists, maybe he can lead those left suffering to a better place or at least prove that goodness can still be found in this cruel world. Abandoning the quest now might mean that all the pain and sacrifices – Gerald’s death, Oakcrest’s destruction – were for nothing.",
      "NextScene": "S090"
    },
    {
      "SceneId": "S090",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The wind from the heights is icy. The hero’s jaw sets. His body is worn, his spirit nearly broken, yet the choice remains his alone.",
      "NextScene": "S091"
    },
    {
      "SceneId": "S091",
      "Type": "choice",
      "ShowInGame": true,
      "Text": "Decision – The Last Leg: At the foot of the perilous Blackwind Pass, the hero must make his ultimate choice.",
      "NextScene": null,
      "LeftChoiceText": "Option 1: Muster whatever hope remains and brave the treacherous mountain pass to seek Ronnie, risking everything for the dream of a land without sorrow.",
      "RightChoiceText": "Option 2: Abandon the quest and turn back, deciding that his journey ends here, and return to the world he knows to make what life he can with the lessons learned.",
      "LeftChoice": "S097",
      "RightChoice": "S107"
    },
    {
      "SceneId": "S092",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 1: Muster whatever hope remains and brave the treacherous mountain pass to seek Ronnie, risking everything for the dream of a land without sorrow.",
      "NextScene": "S093"
    },
    {
      "SceneId": "S093",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 2: Abandon the quest and turn back, deciding that his journey ends here, and return to the world he knows to make what life he can with the lessons learned.",
      "NextScene": "S094"
    },
    {
      "SceneId": "S094",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Continues to Ronnie",
      "NextScene": "S095"
    },
    {
      "SceneId": "S095",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S096"
    },
    {
      "SceneId": "S096",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Continues to Ronnie",
      "NextScene": "S097"
    },
    {
      "SceneId": "S097",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "With a final, tormented glance backward, the hero presses on into the mountain pass. The way is cruelly difficult. Jagged rocks slice at his boots, and frigid winds roar through the narrow cleft, almost as if the mountains themselves are trying to turn him away. But whether out of desperate hope or sheer refusal to face his guilt by returning, he drives himself forward. One step. Then another.",
      "NextScene": "S098"
    },
    {
      "SceneId": "S098",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "High up on the ridge, snow begins to fall in blinding white sheets. The hero staggers, knees weak from exhaustion and hunger, yet he does not stop. He has sacrificed too much to abandon his quest now. Perhaps, he tells himself, if he can just find Ronnie, all the wrongs might be made right – or at least he might find some forgiveness for himself. The cold is merciless; he can no longer feel his fingers, and each breath is a lance of ice in his lungs.",
      "NextScene": "S099"
    },
    {
      "SceneId": "S099",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Hours later, as dusk ghosts over the peaks, the hero finally reaches the top of the pass and descends the far side of the mountains. The snowstorm passes, leaving the world deathly quiet. Beneath a purple twilight sky, he finds a valley stretching out before him. His heart leaps into his throat. Is this it? Is this Ronnie? The valley is broad and ringed by mountains like the one he stands on. He squints, searching for any sign of the lush paradise from his dream. But in the gathering darkness, all he sees are shapes of wilderness – dark stands of trees and open fields blanketed in snow. No gleaming cities of marble, no warm lights of welcoming homes. Only silence and shadows.",
      "NextScene": "S100"
    },
    {
      "SceneId": "S100",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero’s chest tightens. He descends into the valley, stumbling through drifts of snow that reach his knees. Somewhere along the way, he loses his footing and tumbles the last few yards down a slope, landing hard amid a clump of icy boulders. He cries out as pain jolts his already battered body. For a long moment, he simply lies there, snowflakes gathering on his face, the stars pricking the sky one by one.",
      "NextScene": "S101"
    },
    {
      "SceneId": "S101",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Eventually, he forces himself up. Under the faint starlight, the valley reveals itself in pale shades of blue and gray. It is not a barren wasteland – in fact, as he trudges onward, he discovers a frozen stream and the skeletal outlines of fruit trees, their branches laden not with fruit but with snow. It seems this land could be fertile in another season… but where are the people? The hero’s heart sinks further with each step. He passes what looks like an old garden wall made of piled stones, long crumbled. Then, as the moon rises, he sees it: the ruins of a cottage, nearly indistinguishable from the rocks save for a collapsed thatch roof and a rusted iron pot half-buried in snow.",
      "NextScene": "S102"
    },
    {
      "SceneId": "S102",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Despair gnaws at him. Ronnie – if this is indeed Ronnie’s valley – is empty. It was real once; he can see that now. Perhaps long ago, people lived here in peace. But no more. The hero wanders among the remains, finding more foundations of bygone homes. An old well shaft here, a toppled wooden beam there. He kneels and picks up a fragment of something from the snow – a child’s toy carved from wood, depicting a little bird. The wood is decayed and falls apart at his touch. He realizes he is shaking, not just from cold but from the enormity of his disappointment.",
      "NextScene": "S103"
    },
    {
      "SceneId": "S103",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In a clearing at the center of the abandoned village, the hero finally collapses to his knees. A low, ragged moan escapes his lips, a sound of heartbreak that echoes off the silent mountains. He had come all this way, clinging to a dream of a land without sorrow, only to find that sorrow had reached here first. There is no utopia, only the ghost of one. The realization crushes him: maybe there truly is no escape from the cruelties of life. Not out here, and not within his own soul.",
      "NextScene": "S104"
    },
    {
      "SceneId": "S104",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Snow piles on his shoulders as the hero bows his head. Alone in the dark valley, he allows himself to weep – for the dream that died, for the people he failed, for the man he has become. In the morning, if he survives the cold, he will have to decide his next steps. Perhaps he will turn around and stagger back over the mountains to whatever life he can salvage. Perhaps he will try to make a home here among the ruins, living out his days in the one place that once promised peace, even if it’s now empty. Or perhaps… he might simply lie down and let the winter cover him, becoming yet another forgotten story in this hushed place.",
      "NextScene": "S105"
    },
    {
      "SceneId": "S105",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "For now, he weeps until the tears freeze on his cheeks. In this ending, our hero’s perseverance leads him only to the hollow shell of Ronnie – the realization that the paradise he sought has faded away, leaving him with nothing but the echoes of his own regrets.",
      "NextScene": "S106"
    },
    {
      "SceneId": "S106",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S107"
    },
    {
      "SceneId": "S107",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero closes his eyes at the mountain pass and makes a different choice. He cannot continue – not like this, not with the weight of his failures dragging at his heels. With a heavy heart, he turns and begins the long descent back down. The mountains seem almost to sigh around him, the wind less a howl than a low moan, as if lamenting his decision.",
      "NextScene": "S108"
    },
    {
      "SceneId": "S108",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He retraces his steps, each mile heavy with the ghosts of what could have been. When he reaches the foothills, the land is still scarred by war and winter. Smoke from distant conflicts occasionally smudges the horizon, and refugees wander the roads with hollow eyes. The hero merges into this trudging humanity, just another lost soul walking away from the mountains. The dream of Ronnie he locks away deep in his heart, too painful to examine. Better to focus on putting one foot in front of the other.",
      "NextScene": "S109"
    },
    {
      "SceneId": "S109",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In time, he finds himself back at the charred remains of Oakcrest village. Snow has gently blanketed the blackened timbers and unmarked graves. There is an eerie peace to the ruins. The hero moves through them like a shadow. He calls out once, on the faint hope that someone might have returned – perhaps a survivor or a rescue party. But his voice echoes off emptiness. Oakcrest is truly dead.",
      "NextScene": "S110"
    },
    {
      "SceneId": "S110",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Over the next few days, the hero does what little he can as an act of contrition. He gathers stones and builds a crude cairn for the villagers who lost their lives in the attack. One by one, he drags bodies or bones from where they lay and lays them to rest under the cairn, working until his hands are raw and numb. He has no priestly words to offer, only a choked apology whispered through the cold air: “I’m sorry… I’m so sorry.” It is unclear whether he speaks to the dead or to the silent sky.",
      "NextScene": "S111"
    },
    {
      "SceneId": "S111",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "When his grim task is finished, the hero stands alone in the quiet ruin. He realizes he has nowhere to go – no home, no family, no promised land. The fire inside him that once drove him to dream and wander has gone out, doused by guilt and harsh reality. In its place is a cold, hollow resolve. If he cannot find a world without sorrow, he will simply have to live in this one as best he can, carrying his sorrow with him.",
      "NextScene": "S112"
    },
    {
      "SceneId": "S112",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He leaves Oakcrest and travels aimlessly for a while. He avoids towns where possible, not wanting to answer questions or form new attachments. For a while, he hires himself out to merchant caravans as a guard – his sword arm is still strong, and coin at least fills his belly. But he finds no fulfillment in it, only a grim sense of doing what he must to get through each day.",
      "NextScene": "S113"
    },
    {
      "SceneId": "S113",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Years blur together as the hero ascends into the mountains at last. He follows a narrow trail known to locals as Blackwind Pass. The name is well-earned; fierce winds whip down from the snowy peaks, and at times the hero must clutch the rocky wall to keep his balance. With the villagers’ wool blanket draped around him for warmth, he presses on. The higher he climbs, the more the pine forests thin out, replaced by bare granite and patches of snow that never melt.",
      "NextScene": "S114"
    },
    {
      "SceneId": "S114",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "On the fourth day of the ascent, the hero reaches a ledge near the summit of the pass. From here he can see the vast expanse of land behind him – the kingdom, the wilderness, all that he’s traversed. It’s past midday but the sun is hidden behind a bank of gray clouds. He takes shelter in the lee of a boulder to catch his breath. His side wound from the battle twinges dully, but it’s healing. Physically, he is as prepared as he can be for what lies ahead.",
      "NextScene": "S115"
    },
    {
      "SceneId": "S115",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Ahead of him, the path continues over a treacherous-looking ridge blanketed in mist. That ridge is the final barrier – beyond it, according to sparse rumors, one might find a valley or high plateau that could be Ronnie. Or nothing at all. The hero’s heart quickens. This is the closest he has ever been to his dream and yet he hesitates. Over the past weeks, reality has been merciless. He has seen that safety and bliss are fragile things. What if Ronnie is just another illusion, a tale told to give fools hope? And even if it is real and as wonderful as in his dream, can he, with blood on his hands and guilt in his heart, find peace there?",
      "NextScene": "S116"
    },
    {
      "SceneId": "S116",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He thinks of Oakcrest – the way the villagers looked at him as he left. They see a hero in him, but he does not. Not entirely. Part of him yearns to turn back, not out of fear or guilt this time, but out of a sense of responsibility. There are people back there who might still need help – the survivors trying to rebuild, Gerald’s grieving widow, countless others in the war-torn lands who could use a sword arm like his. Perhaps chasing a dream is selfish when reality needs fixing.",
      "NextScene": "S117"
    },
    {
      "SceneId": "S117",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "And yet, Ronnie calls to him like a beacon. In the darkest nights since the war, that dream gave him purpose. If he abandons it now, will he forever wonder what might have been over that ridge? Maybe Ronnie truly is a land without sorrow, and if so, could he forgive himself for not seeking it to the end? Perhaps it could be a sanctuary for those he has helped – if he could find a path, he might lead others there in the future, redeeming his earlier failings.",
      "NextScene": "S118"
    },
    {
      "SceneId": "S118",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The wind howls, carrying flecks of ice that sting his face. The hero’s next decision will shape the rest of his life, however long or short it may be.",
      "NextScene": "S119"
    },
    {
      "SceneId": "S119",
      "Type": "choice",
      "ShowInGame": true,
      "Text": "Decision – The Last Leg: On the brink of the unknown, the hero contemplates his fate. Will he brave the final ascent in search of Ronnie, or turn back to the cruel world he knows?",
      "NextScene": null,
      "LeftChoiceText": "Option 1: Push onward through the mountain pass, driven to see once and for all if the dream of Ronnie is real, regardless of his worthiness.",
      "RightChoiceText": "Option 2: Abandon the quest here and turn back, accepting that survival and reality are all he has left, and that Ronnie was never anything more than a dream.",
      "LeftChoice": "S125",
      "RightChoice": "S139"
    },
    {
      "SceneId": "S120",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 1: Push onward through the mountain pass, driven to see once and for all if the dream of Ronnie is real, regardless of his worthiness.",
      "NextScene": "S121"
    },
    {
      "SceneId": "S121",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 2: Abandon the quest here and turn back, accepting that survival and reality are all he has left, and that Ronnie was never anything more than a dream.",
      "NextScene": "S122"
    },
    {
      "SceneId": "S122",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Continues to Ronnie",
      "NextScene": "S123"
    },
    {
      "SceneId": "S123",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S124"
    },
    {
      "SceneId": "S124",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Continues to Ronnie",
      "NextScene": "S125"
    },
    {
      "SceneId": "S125",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Notwithstanding the emptiness gnawing at his heart, the hero grits his teeth and forges onward over the mountains. He has come too far to turn back now. Perhaps there is nothing for him in the lowlands but ghosts and blood – so he clings to the slim possibility that something better lies ahead, if not for a reward, then at least as a final answer to all his efforts.",
      "NextScene": "S126"
    },
    {
      "SceneId": "S126",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The ascent is brutal. He has no one waiting for him on either side of these peaks, no cheering crowd or anxious friend – only the indifferent wind and his own solitary will driving him on. He loses track of time among the cliffs. Day and night cease to matter; he climbs by instinct, rests when he collapses from fatigue, then wakes to climb again. Memories of his dream of Ronnie are faint now, overshadowed by images of war and loss, but he forces himself to recall that green valley with every icy breath.",
      "NextScene": "S127"
    },
    {
      "SceneId": "S127",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "After endless toil, the hero at last arrives at the crest of the pass, where the world beyond unfolds. In the pale light of dawn, he looks down expecting – hoping – to see some sign of civilization or life. What meets his eyes instead is a vast expanse of untouched nature. Dense forests carpet the foothills below, and a broad plain extends to the horizon. It’s beautiful in a wild way, but entirely empty of obvious settlements. There are no smoke wisps from chimneys, no roads or bridges that he can discern – just virgin land, silent and unconcerned with human wants.",
      "NextScene": "S128"
    },
    {
      "SceneId": "S128",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero descends into this new land with a hollow determination. If there are people here, he will find them. If Ronnie exists at all, he must prove it, if only to justify everything he’s lost. For days he treks through the wilderness. He follows a river downstream, passes under ancient towering oaks and across fields where deer startle at his approach. He finds tracks now and then – a curious hoofprint that might belong to an elk or something more exotic – but no sign of human habitation. Each passing hour erodes his hope a little more.",
      "NextScene": "S129"
    },
    {
      "SceneId": "S129",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Eventually, the hero stumbles upon the remnants of a camp by the riverbank – fire-blackened stones in a ring, and a few fish bones scattered about. His heart leaps; someone has been here, perhaps not long ago. He calls out, a foolish impulse, his voice croaking from disuse: “Hello! Is anyone there?” Only a lonely echo from the woods answers. He waits, but no one emerges.",
      "NextScene": "S130"
    },
    {
      "SceneId": "S130",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "That night, he sits by the cold campfire remains, turning a bone fragment between his fingers, and faces the possibility that Ronnie might truly be nowhere or nothing. The dream that propelled him could have been just that – a dream. The vast quiet around him feels like a verdict: he is utterly alone, and there is no magical refuge to save him from that fact.",
      "NextScene": "S131"
    },
    {
      "SceneId": "S131",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In the following days, the hero presses further east, driven now less by hope and more by stubborn refusal to admit defeat. Cresting a low hill, he finally sees something man-made: a weathered signpost standing at a fork in a crude dirt path. He rushes to it, heart pounding. The sign’s paint is faded and written in a language he doesn’t fully recognize. One arrow points southwest – perhaps back toward the kingdoms – and another points northeast into the unknown, marked with a single word that might be “Ronis” or “Rannis.” Could that be Ronnie, spelled in some local tongue? The hero’s spirit flickers with a last spark. He chooses the northeast path and marches on.",
      "NextScene": "S132"
    },
    {
      "SceneId": "S132",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "But Ronnie, if it was ever here, proves elusive to the bitter end. The path eventually leads to the ruins of a small settlement. Moss-covered stones outline what were once cottages; a fallen watchtower lies crumbling into the soil. It appears this place was abandoned decades ago, maybe after a calamity or simply swallowed by time. In the center, a cracked stone well bears an inscription. The hero rubs away lichen and slowly deciphers the worn letters: “RONIAS.” It’s eerily close to Ronnie.",
      "NextScene": "S133"
    },
    {
      "SceneId": "S133",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "His knees give way and he sits heavily on the edge of the well. This was it. Ronnie was real – a village or town beyond the mountains – and it died alone out here. He cannot know what happened; disease, famine, raiders, or just the draw of returning west. Whatever the cause, the result is the same: he chased a phantom. In a final act of defiance, the hero tilts his head back and lets out a roar – a sound of fury, sorrow, and bitter laughter all at once. The empty windows of ruined homes stare back at him, mute witnesses to his breakdown.",
      "NextScene": "S134"
    },
    {
      "SceneId": "S134",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "When that cathartic howl fades, silence returns. The hero finds himself drained of all desire. He makes a small camp and lights a fire among the ruins, staving off the chill of dusk. Over the flames, he speaks softly, maybe to himself, maybe to the spirits of this dead Ronnie. “I’m here,” he says, voice cracking. “I came… I came all this way.” His words fall flat; there are no answers in the crackle of wood.",
      "NextScene": "S135"
    },
    {
      "SceneId": "S135",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He remains there for a few more days, scavenging what he can – a few wild berries, water from the well. In a collapsed hut, he finds an old, moth-eaten blanket and wraps it around his shoulders. This empty place becomes his unintended destination, the end of a road he never imagined could be so lonely. With nothing and no one to return to, he chooses to linger among Ronnie’s bones, as if guarding the final resting place of his dream.",
      "NextScene": "S136"
    },
    {
      "SceneId": "S136",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Perhaps one day, another traveler will happen upon this ruin and find a weather-beaten man who speaks little, a man who might nod knowingly if asked about a paradise beyond the mountains but who offers no guide. Perhaps they’ll call him a hermit, a madman, or a guardian spirit. Or perhaps he will simply fade away here, one last forgotten soul amid the remnants of a forgotten promise.",
      "NextScene": "S137"
    },
    {
      "SceneId": "S137",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In either case, the journey is over. In this ending, our hero’s relentless pursuit leads only to the forsaken remnants of Ronnie – a harsh revelation that some dreams die before we reach them, leaving him a solitary figure in a land that might have been paradise, once.",
      "NextScene": "S138"
    },
    {
      "SceneId": "S138",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S139"
    },
    {
      "SceneId": "S139",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "At the final threshold, the hero feels something inside him break – the will to believe, perhaps, or the last tether of hope. He shakes his head and whispers to the cold wind, “Enough.” With that, he turns from the mountain pass and begins the long, solitary trek back down. There will be no Ronnie for him. The dream has lost its power; reality, grim as it is, has won out.",
      "NextScene": "S140"
    },
    {
      "SceneId": "S140",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He descends into the war-torn lands without fanfare or direction. He doesn’t return to Oakcrest – that chapter is closed and too painful to revisit. Instead, he drifts from village to village. His demeanor is hardened now; he avoids eye contact and keeps his answers short when asked about his travels. He becomes just another scarred veteran in a world full of them, easily mistaken for a mercenary or a vagabond. In truth, he’s neither at heart, but he finds it simpler to let people assume and not correct them.",
      "NextScene": "S141"
    },
    {
      "SceneId": "S141",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "For a time, the hero takes up work as a caravan guard, escorting merchants through dangerous territories. He fights off the odd bandit ambush with a frightening efficiency – his pent-up anger making him ferocious in combat. Fellow guards give him a wide berth; they mutter that he seems to have a death wish on him, the way he charges headlong into danger with a grimace, rarely even pausing to tend his wounds afterward.",
      "NextScene": "S142"
    },
    {
      "SceneId": "S142",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Off the battlefield, he spends his coin on strong drink and sits alone in the corner of taverns, staring into nothing. If anyone approaches, drawn by the mystique of his armor or the sadness in his eyes, he brusquely sends them away. The kindness in him, the part that once cared about starving strangers or frightened villagers, is buried deep under layers of disillusionment. Occasionally, a memory will surface – a little girl’s scream, an old man reaching out for bread – and he will drown it in another gulp of ale until it sinks back into oblivion.",
      "NextScene": "S143"
    },
    {
      "SceneId": "S143",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Eventually, the hero tires of even the pretense of duty. He leaves the caravans and wanders into a large city, melting into its underbelly. There, among beggars and thieves, he finds a strange sort of kinship. Nobody judges past failures or dashed hopes in the shadows – everyone has their own. The hero rents a small room in a run-down inn by the docks and lives day to day. His once-strong body starts to feel the toll of constant battles and poor diet. A persistent cough troubles him in the winter damp, and an old sword wound on his side aches when it rains.",
      "NextScene": "S144"
    },
    {
      "SceneId": "S144",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "One bleak evening, as he shelters under an awning from a drizzle, the hero overhears a conversation between two sailors. They speak of a voyage across the sea to a “promised land” rumored to lie far to the west, beyond the horizon. The sailors’ eyes shine with the same fervor that once lit his own. The hero lets out a bitter chuckle that turns into a coughing fit. He doesn’t intrude on their discussion, but as they leave, he mutters under his breath: “Fools… there’s no promised land.” The words taste of iron and regret. He realizes he has become the very man who would have discouraged his younger self all those months ago.",
      "NextScene": "S145"
    },
    {
      "SceneId": "S145",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "That night, the hero dreams of mountains. In the dream, he climbs and climbs, only to find nothing on the other side. He wakes with tears in his eyes, feeling as empty as the bed beside him. In the darkness, he finally admits to himself that beyond failing to find Ronnie, he also lost the man he once aspired to be. The realization doesn’t come with a burst of anguish or a vow to change – just a dull acceptance, like acknowledging a chronic pain that will never fully heal.",
      "NextScene": "S146"
    },
    {
      "SceneId": "S146",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Some months later, war engulfs the region once more. When conscription officers come trawling the slums for able-bodied fighters, the hero doesn’t resist. Why would he? Fighting is something he understands, and perhaps a soldier’s death will be simpler than the half-life he’s been leading. He finds himself thrust into another army, another pointless campaign. Those who serve alongside him note his fearless reckless charge and start calling him “the Ghost Knight,” for it’s as if he’s not entirely of this world when he storms the enemy lines.",
      "NextScene": "S147"
    },
    {
      "SceneId": "S147",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In a muddy field far from any home, amidst the din of clashing steel and the screams of the wounded, the hero meets his likely end. Cut off from his unit, he stands back-to-back with a young recruit trembling with terror. For a flicker of a moment, the hero recalls another young man – himself – setting out with high ideals. In a final act of buried chivalry, he defends the boy as wave after wave of foes press in. The recruit survives, dragged to safety by comrades, but the Ghost Knight finally falls to a circle of swords and spears, welcoming the darkness that closes in.",
      "NextScene": "S148"
    },
    {
      "SceneId": "S148",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "His body is piled with the nameless dead, buried in a mass grave without ceremony. In the grander scheme, he passes from memory into myth – a cautionary tale told in taverns about the knight who searched for paradise and never returned, or perhaps a footnote in war annals as an unusually fierce foot soldier. Only the wind over the mountains remembers his whispered hopes, and only the stars that once guided his way mourn the passing of a weary soul.",
      "NextScene": "S149"
    },
    {
      "SceneId": "S149",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In this ending, our hero relinquishes his quest and slips into a life of aimless survival, ultimately finding neither peace nor paradise – a tragic conclusion that underscores the cost of lost faith and the cruelty of a reality that offers no gentle chapter for the once-hopeful knight.",
      "NextScene": "S150"
    },
    {
      "SceneId": "S150",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Keeps His Food",
      "NextScene": "S151"
    },
    {
      "SceneId": "S151",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero hardens his heart and decides he cannot spare his only food. “I’m sorry, I have nothing to give,” he mutters, avoiding the old man’s pleading gaze. With that, he pulls his threadbare cloak tighter and trudges forward, leaving the starving stranger behind. The man’s feeble cries for help trail off into the evening air. Our hero forces himself not to look back, focusing instead on the road ahead and the piece of bread in his hand. He bites into it as he walks, chewing slowly. The stale bread is dry, but it fills his mouth and steadies the gnawing ache in his belly. He tells himself he did what he had to do – survival comes first. Yet, as the dusk deepens, he cannot entirely silence the small voice of guilt in his mind. It asks: would sharing really have doomed you? He shakes his head to clear the thought and presses on.",
      "NextScene": "S152"
    },
    {
      "SceneId": "S152",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "That night, the hero camps alone beneath a canopy of rustling oak leaves. A crescent moon peeks through the branches. Safe in the knowledge that he still has a little food for tomorrow, he allows himself to drift into a light sleep. But rest is uneasy. His dreams conjure the hollow eyes of the old beggar. In one vision, the stranger’s face transforms into that of a corpse asking “Why?” The hero awakens with a start before dawn, sweat on his brow despite the chill. Scolding himself for weakness, he packs up quickly and resumes his journey.",
      "NextScene": "S153"
    },
    {
      "SceneId": "S153",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "With the small ration of bread, the hero’s strength holds out a bit longer than it otherwise might have. Over the next day, he covers many miles. By conserving his portions, he manages to stave off starvation. However, his conscience remains uneasy. Occasionally, he glances over his shoulder, half-expecting to see the old man hobbling after him or lying by the roadside. He sees nothing but empty road and swaying grass. To distract himself, the hero hums a marching song from his soldiering days and keeps his eyes fixed forward. Ronnie lies somewhere beyond those mountains, he reminds himself. He cannot afford to falter now.",
      "NextScene": "S154"
    },
    {
      "SceneId": "S154",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Two days later, clouds gather thick and dark overhead. The hero finds himself in hilly country, with the great mountains now dominating the eastern skyline. By midday, a cold rain begins to fall, drenching the dirt path. He trudges on, head low, the hood of his cloak pulled tight. As he crests a ridge in the late afternoon, a sight stops him in his tracks: far ahead in a valley bowl, pillars of smoke rise into the darkening sky. Not the gentle white wisps of cookfires, but heavy black plumes. The acrid scent on the wind is unmistakable – something is burning on a large scale.",
      "NextScene": "S155"
    },
    {
      "SceneId": "S155",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero’s heart quickens. Smoke could mean a village – possibly in distress. He pushes onward, moving faster now despite the drizzle that makes the rocks slick. As he draws nearer, he begins to hear faint echoes: distant shouts and screams carried on the wind. The path turns and descends toward the valley. Careful to stay low, the hero approaches under the cover of a stand of trees. Peering from behind dripping foliage, he can finally see the source of the smoke.",
      "NextScene": "S156"
    },
    {
      "SceneId": "S156",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "It is a village – or it was, until moments ago. Flames consume several thatched rooftops. Even as rain falls, fire dances and crackles, refusing to die. Chaos reigns in the muddy village lanes below. A band of armed men – clearly bandits by their ragged attire and predatory movements – swarm through the settlement. The hero counts five, six... no, at least seven of them, shouting orders at each other. Villagers dart in terror, trying to flee or hide. He watches in horror as a bandit yanks a screaming woman out of a cottage by her hair and throws her into the mud. Another marauder is dragging a crying child, while two more are busily loading sacks with grain and whatever valuables they can pillage. An old man is sprawled face-down near the central well, ominously motionless.",
      "NextScene": "S157"
    },
    {
      "SceneId": "S157",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero’s blood runs cold. Although he has witnessed violence and cruelty before, something about this scene strikes him deeply – perhaps because it is not war between armies but unbridled slaughter of innocents. A memory flashes: the stranger on the road, begging for mercy that the hero withheld. Is he now about to witness an entire village perish while he stands by? His grip tightens on his sword. This time, it’s not one feeble beggar but dozens of helpless folk facing death.",
      "NextScene": "S158"
    },
    {
      "SceneId": "S158",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He realizes the village is likely the very place the old man had mentioned in his pleas – though our hero never learned the name, it fits the old man’s dire warning. A pang of remorse twists in his chest. If only he had helped that stranger, perhaps he could have learned more or even arrived sooner to warn these villagers. But it’s too late for ifs. The crisis is here, now.",
      "NextScene": "S159"
    },
    {
      "SceneId": "S159",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero is torn. Unlike before, he is not crippled by hunger – he still has some energy, and adrenaline is coursing through him. His soldier’s training urges him to fight; the odds are bad but not impossible if surprise is on his side. On the other hand, seven armed bandits are a formidable threat. He has no allies here, no backup. Charging in could be suicide. Another voice – perhaps the same cold pragmatism that made him walk past the starving man – whispers that this is not his battle. He could slip away unseen; the forest provides a path around the village. If he survives, he could perhaps find help and return later, though it would likely be too late for the victims here.",
      "NextScene": "S160"
    },
    {
      "SceneId": "S160",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Lightning forks through the dark sky, illuminating the village for a brief moment. In that stark flash, the hero sees a terrified teenage boy trying to shield a younger sibling behind a rain barrel. A burly bandit stalks toward them with a spear. The sight makes the hero’s heart lurch. He knows he cannot watch much longer without being overwhelmed by either guilt or the urge to act.",
      "NextScene": "S161"
    },
    {
      "SceneId": "S161",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Water drips from the leaves above him as he crouches, soaked and shivering, wrestling with the decision. Thunder rumbles and the wind carries the sob of that child to his ears. The hero’s jaw sets. He feels the weight of his sword at his side, the same sword that has tasted blood in righteous battle before. Will he draw it now to defend the helpless, or keep it sheathed and creep away under the storm’s cover?",
      "NextScene": "S162"
    },
    {
      "SceneId": "S162",
      "Type": "choice",
      "ShowInGame": true,
      "Text": "Decision – The Burning Village: The hero witnesses bandits ravaging a village in the valley. He has the strength to intervene but also the option to save himself by staying hidden.",
      "NextScene": null,
      "LeftChoiceText": "Option 1: Intervene and attack the bandits, risking his life to protect the villagers.",
      "RightChoiceText": "Option 2: Stay hidden and avoid the fight, leaving the villagers to their fate as he slips away unnoticed.",
      "LeftChoice": "S168",
      "RightChoice": "S197"
    },
    {
      "SceneId": "S163",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 1: Intervene and attack the bandits, risking his life to protect the villagers.",
      "NextScene": "S164"
    },
    {
      "SceneId": "S164",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "Option 2: Stay hidden and avoid the fight, leaving the villagers to their fate as he slips away unnoticed.",
      "NextScene": "S165"
    },
    {
      "SceneId": "S165",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Defends the Village",
      "NextScene": "S166"
    },
    {
      "SceneId": "S166",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S167"
    },
    {
      "SceneId": "S167",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Defends the Village",
      "NextScene": "S168"
    },
    {
      "SceneId": "S168",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Something in the hero snaps into resolve. With a battle cry ripping from his throat, he charges out from the treeline, surprising the marauders. His sudden appearance is like thunder after the lightning; the bandits whirl around in shock as this lone warrior barrels into their midst. The hero’s sword flashes in the stormy gloom and cuts down the spear-wielding bandit before the man can react – the very one who was menacing the children. The bandit gapes in disbelief as he collapses into the mud, and the frightened boy he was attacking scurries away to safety.",
      "NextScene": "S169"
    },
    {
      "SceneId": "S169",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The remaining raiders recover quickly, snarling in anger at the intrusion. They rush at the hero from multiple sides. Rain pours as steel clashes with steel. The hero’s blade meets the axe of a tall brute with a sickening jolt. He sidesteps and lets the man’s momentum carry him past, then slashes across his back. A howl of pain rings out. Another attacker lunges in, swinging a spiked club. The hero parries desperately; the impact sends vibrations up his arm. He counters with a kick to the attacker’s knee, then a swift thrust of his sword finds the bandit’s belly. The man crumples with a groan.",
      "NextScene": "S170"
    },
    {
      "SceneId": "S170",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Despite the hero’s fury and skill, the odds are against him – five bandits still remain, now circling warily. The villagers, emboldened by the sudden aid, begin to fight back in small ways. A villager throws a pot from a window, striking one bandit’s shoulder and drawing a curse. Another villager, the blacksmith’s wife, emerges swinging a pitchfork at a distracted raider, jabbing his leg. These small acts tilt the chaos slightly in the hero’s favor. Still, a heavy-set bandit with a sword nearly as long as the hero’s charges straight at him, bellowing. Their blades meet with a ringing crash. The hero braces with all his might, his boots skidding in the blood-slick mud. The bandit is strong, but the hero fights with something stronger than mere muscle – he fights with regret and righteous anger fueling each strike. With a deft twist, he disarms the big man and head-butts him, sending him reeling.",
      "NextScene": "S171"
    },
    {
      "SceneId": "S171",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The melee roars around the village well. One bandit grabs the hero from behind in a chokehold while another advances from the front. Struggling for breath, the hero uses a trick from his soldier days: he drives his elbow back into the ribs of the man holding him, once, twice – until he hears a crack and the grip loosens. In that instant, he ducks, causing the bandit in front to hesitate lest he hit his ally. Seizing the moment, the hero sweeps his sword in a low arc, cutting the legs of the one before him. The man screams and topples. The hero spins and delivers a fatal strike to the one behind, who is still doubled over from the rib injury. Warm blood mixes with cold rain on the hero’s face and hands.",
      "NextScene": "S172"
    },
    {
      "SceneId": "S172",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "At last, the remaining two bandits lose their nerve. Seeing four of their comrades dead or incapacitated, they turn tail and flee into the storm, disappearing toward the woods. The fight is over as abruptly as it began. The hero stands panting in the village square, chest heaving, rain washing the blood from his sword. His adrenaline slowly ebbs, and the reality of what he’s done – and nearly done – settles in. Bodies lie around him in the mud, and several of the cottages burn lower, wet thatch hissing under the downpour. The battle has been won, but only in part: two of the attackers escaped, and more importantly, the village has paid a terrible price before the hero intervened.",
      "NextScene": "S173"
    },
    {
      "SceneId": "S173",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Villagers begin to emerge, trembling but alive. A few sob with relief upon seeing that the bandits are gone. Some rush to tend to the wounded. The young boy and his sister, whom the hero saved at the outset, stare at him with wide eyes as if he were a figure from one of the old heroic ballads. The hero, however, feels more pain than glory. A shallow cut slashes across his left forearm and a bruise is already swelling on his shoulder. Worse is the ache inside his chest – the awareness of how close he came to walking away again.",
      "NextScene": "S174"
    },
    {
      "SceneId": "S174",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The survivors gather around their rescuer, offering tearful thank-yous. They call him “savior” and “knight”, lifting him up with words of praise. The hero accepts their gratitude with a faint nod, but his eyes are downcast. As they usher him into the largest remaining house to dry off and tend to his wounds, he spots an elderly woman kneeling over one of the fallen bandits, her fists pounding weakly on the corpse. He realizes with a start that the dead bandit wears a tattered royal army cloak – perhaps a deserter or former soldier. The woman is crying and shouting a name… “Gerald.” The hero’s heart skips. He moves closer and listens as the grief-stricken villager sobs, explaining to those comforting her that Gerald, her husband and the village elder, left two days ago seeking food or aid but never returned. In her delirium of sorrow, she mistakes the dead bandit for her husband’s body, or perhaps she is simply mourning all that was lost.",
      "NextScene": "S175"
    },
    {
      "SceneId": "S175",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero’s stomach turns to ice. Gerald – that was the name the starving old man had uttered. Could it be the same person? Pieces fall into place: the beggar on the road was likely the elder of this village, driven to desperation by hunger. The hero’s jaw clenches as a wave of guilt crashes over him. He had left Gerald to die alone on the roadside. And here is Gerald’s wife, wailing in despair, believing him lost forever. The hero wants to speak, to tell her that her husband was alive the last he saw – but what comfort would that be now? He doesn’t even know if Gerald survived after he walked away. Shame and regret churn inside him, but he swallows them down. This is neither the time nor place to unveil his sins. Instead, he silently vows that if he ever has the chance, he will search for Gerald or at least ensure this woman is cared for.",
      "NextScene": "S176"
    },
    {
      "SceneId": "S176",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Over the next day, the hero stays in the ravaged village to assist the people of Oakcrest (as he learns it’s called). Despite losing their elder and several others in the attack, the villagers persevere. They extinguish the fires and salvage what they can from the wreckage. The hero, despite his own exhaustion, helps dig graves for the fallen – an act of penance and respect. He works beside the very people he nearly abandoned, and each shovel of earth feels like it’s lifting a weight from his conscience. The rain finally stops by the second day, leaving the air crisp and smelling of wet ashes.",
      "NextScene": "S177"
    },
    {
      "SceneId": "S177",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In gratitude for his bravery, the villagers provide the hero with provisions for the road. They refill his water skin and give him a sack containing a few loaves of bread, dried apples, and a wedge of hard cheese. One man offers a half-dozen arrows and an old hunting bow, insisting the hero take them for protection. Additionally, the village blacksmith’s wife presses a warm woolen blanket into the hero’s arms, saying, “For the cold nights ahead.” He is reluctant to take these gifts – the villagers have so little left – but they insist, insisting that he saved all they have.",
      "NextScene": "S178"
    },
    {
      "SceneId": "S178",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "On the morning of his departure, those who can walk accompany him to the edge of the village. They look to him with a mixture of admiration and pleading hope. “If you truly go beyond the mountains,” an old grandfather says, leaning on a stick, “remember us, and if you find something good there… perhaps send word.” The hero nods solemnly. He cannot bring himself to smile, but he places a hand over his heart. “I will remember,” he promises quietly, the vow carrying double meaning in his mind.",
      "NextScene": "S179"
    },
    {
      "SceneId": "S179",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He leaves Oakcrest under a clear sky, the storm finally broken. As he climbs into the foothills, each step feels a little lighter than before. The supplies and rest have renewed his body, and the act of defending the village – however late – has somewhat restored his spirit. He reflects on the twists of fate: by keeping his bread from Gerald, he survived to save the village, yet that very choice cost Gerald his chance. Life, he muses bitterly, is a cruel ledger of losses and gains. Perhaps Ronnie, if it exists, can balance that ledger – a place with no more hard choices between bad and worse.",
      "NextScene": "S180"
    },
    {
      "SceneId": "S180",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The days turn colder as the hero ascends into the mountains at last. He follows a narrow trail known in rumor as Blackwind Pass. The name is well-earned; fierce winds whip down from the snowy peaks, and at times the hero must clutch the rocky wall to keep his balance. With the villagers’ wool blanket draped around him for warmth, he presses on. The higher he climbs, the more the pine forests thin out, replaced by bare granite and patches of snow that never melt.",
      "NextScene": "S181"
    },
    {
      "SceneId": "S181",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "On the fourth day of the ascent, the hero reaches a ledge near the summit of the pass. From here he can see the vast expanse of land behind him – the kingdom, the wilderness, all that he’s traversed. It’s past midday but the sun is hidden behind a bank of gray clouds. He takes shelter in the lee of a boulder to catch his breath. His side wound from the battle (or rather, from the fight he initially avoided) twinges dully, but it’s healing. Physically, he is as prepared as he can be for what lies ahead.",
      "NextScene": "S182"
    },
    {
      "SceneId": "S182",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Ahead of him, the path continues over a treacherous-looking ridge blanketed in mist. That ridge is the final barrier – beyond it, according to sparse rumors, one might find a valley or high plateau that could be Ronnie. Or nothing at all. The hero’s heart quickens. This is the closest he has ever been to his dream and yet he hesitates. Over the past weeks, reality has schooled him in disappointment. He has learned that sometimes doing the right thing comes at great cost, and doing the selfish thing can exact a cost of its own on the soul. What will he find beyond this ridge – redemption or more regret?",
      "NextScene": "S183"
    },
    {
      "SceneId": "S183",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He steels himself and pushes on through the swirling mist. Every muscle in his body protests, but he ignores the weariness. Finally, the trail opens out onto a high plateau. The mists part, and the hero’s breath catches. Below him sprawls a wide, fertile valley much like the one in his dream. A river sparkles in the light of a sun that is breaking through the clouds at last. Clusters of trees, some bearing the autumn gold of late season, dot the landscape. And there – could it be? – nestled by the riverside, a small collection of rooftops.",
      "NextScene": "S184"
    },
    {
      "SceneId": "S184",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Heart thudding, the hero descends carefully, hardly daring to believe his eyes. As he gets closer, details emerge: smoke from hearths rising lazily into the afternoon sky, a handful of people moving about – tiny figures from this distance, but undeniably there. It’s not a grand city or an endless paradise, but it is life. A settlement beyond the mountains.",
      "NextScene": "S185"
    },
    {
      "SceneId": "S185",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "He approaches slowly, cautious not to startle anyone. At the edge of the village (for that’s what it is, a modest village), he passes carved wooden totems planted in the ground, symbols perhaps of good fortune or guardianship. Villagers spot him and pause their work, eyeing the stranger with a mix of curiosity and wariness. They are healthy-looking folk, plainly dressed, carrying on the simple labors of farming and herding. It strikes the hero how normal it all is – not an enchanted utopia, but a real community.",
      "NextScene": "S186"
    },
    {
      "SceneId": "S186",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "One man, broad-shouldered and holding a woodcutter’s axe, steps forward, not threateningly but with understandable caution. “Hail, traveler,” he calls. “You come from the mountains?” The hero nods and removes his hood, revealing a weary but hopeful face. “I do,” he replies hoarsely. “I… I seek Ronnie. Is this place…?” An older woman, perhaps recognizing the longing in his tone, smiles kindly. “Some call these lands Ronnie, yes. You’re among friends here.”",
      "NextScene": "S187"
    },
    {
      "SceneId": "S187",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "At those words, the hero nearly collapses – from relief, from exhaustion, from the unfamiliar sensation of joy welling in his chest. They rush to support him as he sways, guiding him to a log bench by a well. The villagers pepper him with gentle questions: How long had he traveled? Is he hungry? What news from beyond the peaks? The hero, fighting back tears, tells a humble version of his story – that he came seeking a better place after much hardship. The villagers exchange looks of understanding; many here came in similar fashion, it turns out, fleeing the endless wars and droughts of the outer world.",
      "NextScene": "S188"
    },
    {
      "SceneId": "S188",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "They bring him water, warm broth, and bread. As the hero eats, he feels the last pieces of ice around his heart melt away. He has found what he was beginning to doubt ever existed: a haven where kindness has a foothold. Over the next days, he learns the village’s name – Rivermark – and it indeed sits in what older maps call the Ronnie Valley. Sheltered by natural barriers, untouched by the chaos outside, it’s a place where life is simpler and gentler. Neighbors resolve disputes at the communal hearth, children know no fear of soldiers or slavers, and the earth yields enough that no one starves through winter.",
      "NextScene": "S189"
    },
    {
      "SceneId": "S189",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero finds himself opening up to these people in a way he hadn’t in years. One evening he shares the full tale of his journey – the starving man he failed to help, the village he nearly abandoned, and how those experiences changed him. There are tears in many eyes around the circle by the fire as he speaks. When he finishes, the village elder – the broad-shouldered woodcutter who greeted him – places a hand on his shoulder. “You have carried a heavy burden,” the elder says softly. “But know that your road led you here for a reason. Whatever mistakes you made, you’ve learned from them, and you’re among friends now. We find no fault in a man who seeks to better himself.”",
      "NextScene": "S190"
    },
    {
      "SceneId": "S190",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Those words lift a weight the hero didn’t realize he was still carrying. In the warm glow of that fire, he feels accepted fully, scars and all.",
      "NextScene": "S191"
    },
    {
      "SceneId": "S191",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In the seasons that follow, the hero becomes an integral part of Rivermark. His martial skills are rarely needed, but he trains a few keen young adults in swordplay and archery just in case, instilling in them the principle that strength is meant to protect, not oppress. He helps reinforce the wooden palisade that rings the village, a project started after hearing his stories of bandit attacks. In the fields, he proves as handy with a plow as he once was with a spear, and he finds unexpected satisfaction in coaxing life from the soil.",
      "NextScene": "S192"
    },
    {
      "SceneId": "S192",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Sometimes he ventures to the valley’s edge with a few companions, scouting the passes to ensure no great armies or dangerous wanderers approach Ronnie. These excursions bring him a quiet sense of guardianship – he is determined that what he helped build in Oakcrest and found here will not be lost if he can help it.",
      "NextScene": "S193"
    },
    {
      "SceneId": "S193",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "On one such outing, while gazing westward from a peak, the hero can’t help but recall the faces of those he left. He wonders briefly if Gerald’s widow ever found peace, or if Oakcrest still stands strong. He likes to think it does. A fellow scout notices his distant look and asks what’s on his mind. The hero simply smiles and replies, “Remembering some dear people.” And that is enough.",
      "NextScene": "S194"
    },
    {
      "SceneId": "S194",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "In time, the hero makes a home for himself in Ronnie. He even learns to laugh again – a deep, genuine laugh that surprises him the first time it happens, while hoisting a child onto his shoulders during a spring festival. The bitterness and regret that once haunted him recede like shadows at dawn. They will never disappear entirely, but they no longer define him.",
      "NextScene": "S195"
    },
    {
      "SceneId": "S195",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Surrounded by peace, purpose, and friendship, the knight who was once adrift finds that Ronnie was not only a place on a map, but a state of being he had to grow into. In this ending, our hero overcomes his darkest impulses and is rewarded by finding the hidden refuge of Ronnie. There, at last, he lays down his burdens, living out his days as a protector and friend among people who embody the very peace and kindness he longed for.",
      "NextScene": "S196"
    },
    {
      "SceneId": "S196",
      "Type": "meta",
      "ShowInGame": false,
      "Text": "If the Hero Turns Back",
      "NextScene": "S197"
    },
    {
      "SceneId": "S197",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "The hero stands at the crossroads of destiny and decides that his place is back in the world he knows, fighting for those who cannot fight for themselves. With a final, longing look at the mountain heights, he pivots and begins the journey down toward Oakcrest and the kingdom beyond. Ronnie will remain a legend – one he now entrusts to whatever higher powers there may be – while he devotes himself to the tangible needs of the present.",
      "NextScene": "S198"
    },
    {
      "SceneId": "S198",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "When he returns to Oakcrest, the villagers are surprised but overjoyed. They crowd around, asking eagerly if he found the wondrous land he sought. The hero simply smiles and says, “I found that my heart never truly left here.” They don’t press for details, seeing the contentment in his eyes. In truth, though part of him wonders what might have been, he feels a profound rightness in being back among these people. They are his people now; by defending them and sharing hardship with them, he forged a bond stronger than any promise of a distant paradise.",
      "NextScene": "S199"
    },
    {
      "SceneId": "S199",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Life in Oakcrest gains a steady rhythm under the hero’s quiet leadership. He declines any formal titles or authority, insisting he is no lord, just a man doing his duty. Yet everyone turns to him when guidance is needed. He mediates disputes over livestock or land with a fair and patient hand. He teaches the children how to track animals in the woods and the value of honesty and courage. He spends long days repairing the village’s dilapidated mill and long nights patrolling the outskirts to ensure no threat approaches unseen.",
      "NextScene": "S200"
    },
    {
      "SceneId": "S200",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "News of Oakcrest’s revival and its selfless guardian spreads to neighboring villages. In time, pleas for help begin to arrive – a letter from a hamlet a day’s ride away, begging for aid against encroaching brigands; a messenger from a distant town requesting advice on fortifications. The hero answers each call as best he can. Sometimes he travels alone to lend his sword and expertise; other times he sends a few capable volunteers from Oakcrest’s ranks, men and women he has trained who are eager to pay forward the protection they’ve enjoyed.",
      "NextScene": "S201"
    },
    {
      "SceneId": "S201",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Gradually, a network of villages forms, each inspired by Oakcrest’s example of resilience and mutual aid. The hero finds himself at the heart of something larger than one settlement – a movement of common folk standing together to defend their peace. It is no grand army, but it doesn’t need to be; they fight only when they must, and always for the right reasons. In each place he goes, the hero plants seeds of hope and unity, just as he once dreamed hope could be found across the mountains.",
      "NextScene": "S202"
    },
    {
      "SceneId": "S202",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Years later, grey of hair but bright of spirit, the hero sits on a bench outside the Oakcrest meeting hall, watching a group of youngsters train with wooden swords under the tutelage of one of his former pupils. He feels a deep pride – they will grow up strong and just, ready to shield the innocent. A traveling bard passes through one day, singing a ballad about a valiant knight who turned down a king’s gold and a wizard’s secrets to care for a humble village. The hero chuckles when he hears it, a bit embarrassed by the embellishments. He never sought fame, but perhaps these tales will inspire others to cherish what truly matters: kindness, bravery, and community.",
      "NextScene": "S203"
    },
    {
      "SceneId": "S203",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "As twilight settles in that evening, the hero gazes west where the sun dips behind the silhouette of the mountains. In his hand, he holds a small carving – a figurine of a knight that one of the children gave him in thanks. He thinks of Ronnie sometimes, with a gentle wistfulness. Maybe it was real, maybe not. It doesn’t matter anymore. In the laughter echoing from the village green and the golden glow spilling from cottage windows, he recognizes that he has helped create a kind of Ronnie here in these very fields – a place where sorrow is met with compassion and no one is left to suffer alone.",
      "NextScene": "S204"
    },
    {
      "SceneId": "S204",
      "Type": "narration",
      "ShowInGame": true,
      "Text": "Surrounded by friends, with a legacy of lives improved by his choices, the hero finally understands that his journey of self-discovery did not require reaching a mythical land. It required finding the best in himself and sharing it with others. And that is exactly what he did. In this ending, our hero forsakes the lure of an unknown paradise to lead and protect his own corner of the world, forging a living haven through his deeds – a legacy far more real and precious than any dream.",
      "NextScene": null
    }
  ]
}